superbrobenji/lap-timer/test_apps/core_selftest/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=40960
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_ESP_INT_WDT=y
CONFIG_FREERTOS_HZ=1000
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=6144
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
